In [2]:
## importing the pandas
import pandas as pd

In [3]:
## creating data frames from scratch
df = pd.DataFrame([[1,2,3],[4,5,6],[8,5,9]])
print(df.head())

print("-"*30)

df = pd.DataFrame([[1,2,3],[4,5,6],[8,5,9]], columns = ["a","b","c"])
print(df.head())

print("-"*30)

df = pd.DataFrame([[1,2,3],[4,5,6],[8,5,9]], columns = ["a","b","c"], rows = ["A","B","C"])  ## In pandas, the argument is not row — it should be index
print(df.head())

   0  1  2
0  1  2  3
1  4  5  6
2  8  5  9
------------------------------
   a  b  c
0  1  2  3
1  4  5  6
2  8  5  9
------------------------------

TypeError: DataFrame.__init__() got an unexpected keyword argument 'rows'

In [ ]:
df = pd.DataFrame([[1,2,3],[4,5,6],[8,5,9]], columns = ["a","b","c"], index = ["A","B","C"])
df.head()

In [ ]:
print(df.head(2))
print(df.tail(2))       ##get the last two rows
print(df.columns)
print(df.index)         
print(df.index.tolist())

In [4]:
print(f"{df.info()} \n")

## summary
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0 bytes
None

              a         b    c
count  3.000000  3.000000  3.0
mean   4.333333  4.000000  6.0
std    3.511885  1.732051  3.0
min    1.000000  2.000000  3.0
25%    2.500000  3.500000  4.5
50%    4.000000  5.000000  6.0
75%    6.000000  5.000000  7.5
max    8.000000  5.000000  9.0

#### Series as specialized dictionary

In [5]:
dictionaries = {"Maths":"56", 
                "Statistics":"78", 
                "Data science":"56", 
                "Machine learning":"87"}
subject_code = pd.Series(dictionaries)
subject_code

Maths               56
Statistics          78
Data science        56
Machine learning    87
dtype: object

In [6]:
lists = ([[23,25,45,67],
         [65,76,87,22],
         [98,56,49,45]])
print(f"{pd.Series(lists)} \n")

lists = ([23,25,45,67])
print(f"{pd.Series(lists)}")

0    [23, 25, 45, 67]
1    [65, 76, 87, 22]
2    [98, 56, 49, 45]
dtype: object

0    23
1    25
2    45
3    67
dtype: int64

In [7]:
## index defaults to the sorted dictionary keys

data = pd.Series(({2:"Statistics" , 3:"Maths" , 1:"English"}), index=[1,2,3])
print(data)
pd.Series({2:'a', 1:'b', 3:'c'})

1       English
2    Statistics
3         Maths
dtype: object

2    a
1    b
3    c
dtype: object

In [8]:
student_info = {"name": "Alice",
                "age": 20,
                "major": "Computer Science",
                "courses": ["Python", "Data Structures", "Algorithms"]}

info = pd.Series(student_info)
info

name                                       Alice
age                                           20
major                           Computer Science
courses    [Python, Data Structures, Algorithms]
dtype: object

In [9]:
### accessing 
print(info["name"])
print(info["courses"])
print(info["age"])

print(subject_code["Maths":"Data science"])

Alice
['Python', 'Data Structures', 'Algorithms']
20
Maths           56
Statistics      78
Data science    56
dtype: object

### The Pandas DataFrame Object

#### DataFrame as a generalized NumPy array

In [10]:
dictionaries = {"Maths":"45", 
                "Statistics":"69", 
                "Data science":"89", 
                "Machine learning":"78"}
print(f" {pd.Series(dictionaries)} \n") 

## Suppose you want to add a name before the subjects, and a percentage after marks
name = ["John", "Kavin", "Padma","Sree"]
marks = [45,69,89,78]
overall_percentage = [45.23,68.99,89.34,77.99]
subjects = ["Maths" , "Statistics" , "Data science" , "Machine learning"]

### DataFrame is a two-dimensional array with both flexible row indices and flexible column names
info = pd.DataFrame({"name" : name , "marks" : marks , "subject":subjects , "percentage":overall_percentage} , index =["1","2","3","4"])
print(f" {info}  \n")

info = pd.DataFrame({"marks" : marks , "subject":subjects , "percentage":overall_percentage} , index =["John", "Kavin", "Padma","Sree"])
print(f" {info}  \n")

### Series is of a one-dimensional array with flexible indices
infor = pd.Series({"name" : name , "marks" : marks , "subject":subjects , "percentage":overall_percentage})
print(f"\n {infor} \n")

 Maths               45
Statistics          69
Data science        89
Machine learning    78
dtype: object

     name  marks           subject  percentage
1   John     45             Maths       45.23
2  Kavin     69        Statistics       68.99
3  Padma     89      Data science       89.34
4   Sree     78  Machine learning       77.99

        marks           subject  percentage
John      45             Maths       45.23
Kavin     69        Statistics       68.99
Padma     89      Data science       89.34
Sree      78  Machine learning       77.99


 name                                 [John, Kavin, Padma, Sree]
marks                                          [45, 69, 89, 78]
subject       [Maths, Statistics, Data science, Machine lear...
percentage                         [45.23, 68.99, 89.34, 77.99]
dtype: object

In [11]:
print(info.index)
print(info.columns)

Index(['John', 'Kavin', 'Padma', 'Sree'], dtype='object')
Index(['marks', 'subject', 'percentage'], dtype='object')

In [12]:
print(info["marks"])
print(info[["subject" , "percentage"]])
print(info["subject" , "percentage"])  ## # This is interpreted as a single tuple key

John     45
Kavin    69
Padma    89
Sree     78
Name: marks, dtype: int64
                subject  percentage
John              Maths       45.23
Kavin        Statistics       68.99
Padma      Data science       89.34
Sree   Machine learning       77.99

KeyError: ('subject', 'percentage')

In [ ]:
print(f" {pd.DataFrame(info , columns = ["marks"])} \n")
print(f" {pd.DataFrame(info , columns = ["percentage"])} \n")

In [ ]:
pd.DataFrame([{"Abhi":250 , "Hema":350},{"Hema":467 , "Sree":897}])  ## even if dictionaries are missing, Pandas will fill them in with NaN

In [ ]:
## two-dimensional NumPy array
import numpy as np

a = pd.DataFrame(np.random.randint(10,20 ,(4,5)) , index = ["1","2","3","4"] , columns = ["A","B","C","D","E"])
a

In [64]:
##  NumPy structured array
data = np.zeros(5, dtype = [("name","U10"),("marks","i4"),("overall_percentage","f8")])
name = ["John", "Kavin", "Leo Das", "Padma","Sree"]
marks = [45,69,89,27,78]
overall_percentage = [45.23,68.99,89.34,26.55,77.99]

data["name"] = name
data["marks"] = marks
data["overall_percentage"] = overall_percentage

print(f" {data} \n")
print(f"\n {pd.DataFrame(data)} \n")

 [('John', 45, 45.23) ('Kavin', 69, 68.99) ('Leo Das', 89, 89.34)
 ('Padma', 27, 26.55) ('Sree', 78, 77.99)]


       name  marks  overall_percentage
0     John     45               45.23
1    Kavin     69               68.99
2  Leo Das     89               89.34
3    Padma     27               26.55
4     Sree     78               77.99

In [69]:
## Index Object
inde = pd.Index([2, 3, 5, 7, 11])  ## Index object can be thought of either as an Immutable array or as an ordered set 
inde

Index([2, 3, 5, 7, 11], dtype='int64')

In [71]:
print(inde.size, inde.shape, inde.ndim, inde.dtype)

5 (5,) 1 int64

In [78]:
numpy = np.array([2, 3, 5, 7, 11])
print(f" {numpy} \n")

index_obj = pd.Index([2, 3, 5, 7, 11])
print(f" {index_obj} \n")

## difference between numpy and index
numpy[0] = 99
print(f" {numpy} \n") ##mutable

index_obj[0] = 99 ##immutable
print(f" {index_obj} \n")

 [ 2  3  5  7 11]

 Index([2, 3, 5, 7, 11], dtype='int64')

 [99  3  5  7 11]

TypeError: Index does not support mutable operations

#### Data Indexing and Selection

In [16]:
import pandas as pd

students = ({"John" : 55.54 , "Kavin":65.22 , "Padma" : 45.44 , "Suresh":87.34 , "Dev":34.65})
subject = ({"John" : "Statistics" , "Kavin":"Mathematics" , "Padma" : "Chemistry" , "Suresh":"Physics" , "Dev":"Biotechnology"})
data = pd.DataFrame({"marks":students , "subject":subject})
data

        marks        subject
John    55.54     Statistics
Kavin   65.22    Mathematics
Padma   45.44      Chemistry
Suresh  87.34        Physics
Dev     34.65  Biotechnology

In [17]:
print(data["subject"])
data.marks

John         Statistics
Kavin       Mathematics
Padma         Chemistry
Suresh          Physics
Dev       Biotechnology
Name: subject, dtype: object

John      55.54
Kavin     65.22
Padma     45.44
Suresh    87.34
Dev       34.65
Name: marks, dtype: float64

In [18]:
## adding a new column
data["percentage"] = (data["marks"]/100) * 100
data

        marks        subject  percentage
John    55.54     Statistics       55.54
Kavin   65.22    Mathematics       65.22
Padma   45.44      Chemistry       45.44
Suresh  87.34        Physics       87.34
Dev     34.65  Biotechnology       34.65

In [19]:
### transpose the full DataFrame to swap rows and columns
data.T

                  John        Kavin      Padma   Suresh            Dev
marks            55.54        65.22      45.44    87.34          34.65
subject     Statistics  Mathematics  Chemistry  Physics  Biotechnology
percentage       55.54        65.22      45.44    87.34          34.65

In [23]:
print(data.marks["John"])
print(data.subject["John"])

55.54
Statistics

In [47]:
### uses of loc, iloc, and ix indexers
students = ({"John" : 55.54 , 
             "Kavin":65.22 , 
             "Padma" : 45.44 , 
             "Suresh":87.34 , 
             "Dev":34.65 , 
             "Sree":57.98 ,
             "Mathew":76.87 ,
             "Sachin":65.33})
subject = ({"John" : "Statistics" ,
            "Kavin":"Mathematics" , 
            "Padma" : "Chemistry" , 
            "Suresh":"Physics" , 
            "Dev":"Biotechnology",
            "Sree":"Computer science" ,
            "Mathew":"Data science" ,
            "Sachin":"AI ML"})
data = pd.DataFrame({"subject":subject , "marks":students })
data

                 subject  marks
John          Statistics  55.54
Kavin        Mathematics  65.22
Padma          Chemistry  45.44
Suresh           Physics  87.34
Dev        Biotechnology  34.65
Sree    Computer science  57.98
Mathew      Data science  76.87
Sachin             AI ML  65.33

In [48]:
print(data.marks)

## If you want to select specific students, you can use slicing (iloc,loc)
print(data.iloc[:3, :2])   ##select first 3 rows,select first 2 columns
print(data.iloc[2:7, 0:2])

print(data.loc["Kavin":"Dev","subject":"marks"])

John      55.54
Kavin     65.22
Padma     45.44
Suresh    87.34
Dev       34.65
Sree      57.98
Mathew    76.87
Sachin    65.33
Name: marks, dtype: float64
           subject  marks
John    Statistics  55.54
Kavin  Mathematics  65.22
Padma    Chemistry  45.44
                 subject  marks
Padma          Chemistry  45.44
Suresh           Physics  87.34
Dev        Biotechnology  34.65
Sree    Computer science  57.98
Mathew      Data science  76.87
              subject  marks
Kavin     Mathematics  65.22
Padma       Chemistry  45.44
Suresh        Physics  87.34
Dev     Biotechnology  34.65

In [49]:
## masking
data.loc[data.marks > 50 , ["subject","marks"]]

                 subject  marks
John          Statistics  55.54
Kavin        Mathematics  65.22
Suresh           Physics  87.34
Sree    Computer science  57.98
Mathew      Data science  76.87
Sachin             AI ML  65.33

In [52]:
data.loc[data.marks > 50 , ["marks"]]

        marks
John    55.54
Kavin   98.00
Suresh  87.34
Sree    57.98
Mathew  76.87
Sachin  65.33

In [55]:
##  set or modify values
data.iloc[1,1] = 98
data

                 subject  marks
John          Statistics  55.54
Kavin        Mathematics  98.00
Padma          Chemistry  45.44
Suresh           Physics  87.34
Dev        Biotechnology  34.65
Sree    Computer science  57.98
Mathew      Data science  76.87
Sachin             AI ML  65.33

#### Operating on Data in Pandas

In [60]:
### Ufuncs: Index Preservation - Universal functions are vectorized functions that operate element-wise on arrays
import numpy as np
import pandas as pd

students = ({"John" : 55.54 , "Kavin":65.22 , "Padma" : 45.44 , "Suresh":87.34 , "Dev":34.65})
student = pd.Series(students)

stu = np.square(student)
print(stu)

stu = np.sqrt(stu)
print(stu)

John      3084.6916
Kavin     4253.6484
Padma     2064.7936
Suresh    7628.2756
Dev       1200.6225
dtype: float64
John      55.54
Kavin     65.22
Padma     45.44
Suresh    87.34
Dev       34.65
dtype: float64

In [63]:
df = pd.DataFrame(np.random.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
print(df)
print(np.sin(df))
np.sin(df * np.pi / 4)

   A  B  C  D
0  0  2  1  3
1  4  2  8  1
2  0  0  6  6
          A         B         C         D
0  0.000000  0.909297  0.841471  0.141120
1 -0.756802  0.909297  0.989358  0.841471
2  0.000000  0.000000 -0.279415 -0.279415

              A    B             C         D
0  0.000000e+00  1.0  7.071068e-01  0.707107
1  1.224647e-16  1.0 -2.449294e-16  0.707107
2  0.000000e+00  0.0 -1.000000e+00 -1.000000

In [66]:
### Index Alignment - binary operations on two Series or DataFrame objects
A = pd.Series([1,4,3] , index=[0,1,2])
B = pd.Series([5,6,7] , index=[0,3,2])
print(A)
print(B)

0    1
1    4
2    3
dtype: int64
0    5
3    6
2    7
dtype: int64

In [68]:
print(A+B)
print(A.add(B))

0     6.0
1     NaN
2    10.0
3     NaN
dtype: float64
0     6.0
1     NaN
2    10.0
3     NaN
dtype: float64

In [69]:
A.add(B, fill_value=0)

0     6.0
1     4.0
2    10.0
3     6.0
dtype: float64

6.0   # (1+5)

4.0   # (4+0, since index=1 not in B → fill with 0)

10.0   # (3+7)

6.0   # (0+6, since index=3 not in A → fill with 0)

In [70]:
A.add(B, fill_value=2)

0     6.0
1     6.0
2    10.0
3     8.0
dtype: float64

##### Index alignment in DataFrame

In [74]:
A = pd.DataFrame(np.random.randint(10,30 , size= (4,4)) , columns = list("ABCD"))
print(A)
B = pd.DataFrame(np.random.randint(20,50 , size= (3,3)) , columns = ["A","C","B"])
print(B)

    A   B   C   D
0  10  27  15  27
1  21  12  20  16
2  27  28  22  11
3  20  22  25  25
    A   C   B
0  47  25  21
1  34  24  38
2  44  23  34

In [75]:
A+B
A.add(B)

      A     B     C   D
0  57.0  48.0  40.0 NaN
1  55.0  50.0  44.0 NaN
2  71.0  62.0  45.0 NaN
3   NaN   NaN   NaN NaN

In [77]:
A.add(B , fill_value = 0)

      A     B     C     D
0  57.0  48.0  40.0  27.0
1  55.0  50.0  44.0  16.0
2  71.0  62.0  45.0  11.0
3  20.0  22.0  25.0  25.0

In [87]:
 
fill = A.stack().mean()  ##average of all values in A
print(fill)

fill_ = B.stack().median() ##average of all values in B
print(fill_)

20.5
34.0

In [88]:
print(A.add(B , fill_value = fill))
print(A.add(B , fill_value = fill_))

      A     B     C     D
0  57.0  48.0  40.0  47.5
1  55.0  50.0  44.0  36.5
2  71.0  62.0  45.0  31.5
3  40.5  42.5  45.5  45.5
      A     B     C     D
0  57.0  48.0  40.0  61.0
1  55.0  50.0  44.0  50.0
2  71.0  62.0  45.0  45.0
3  54.0  56.0  59.0  59.0

both A and B had values (same row index + column), they’re added

Where only one existed, the other is treated as fill (mean of A OR B)

In [89]:
A.subtract(B)

      A     B     C   D
0 -37.0   6.0 -10.0 NaN
1 -13.0 -26.0  -4.0 NaN
2 -17.0  -6.0  -1.0 NaN
3   NaN   NaN   NaN NaN

In [90]:
A.multiply(B , fill_value = 0)

        A      B      C    D
0   470.0  567.0  375.0  0.0
1   714.0  456.0  480.0  0.0
2  1188.0  952.0  506.0  0.0
3     0.0    0.0    0.0  0.0

In [91]:
B.pow(A)

              A             B             C   D
0  5.259913e+16  5.010960e+35  9.313226e+20 NaN
1  1.448963e+32  9.065738e+18  4.019989e+27 NaN
2  2.361687e+44  7.610438e+42  9.078464e+29 NaN
3           NaN           NaN           NaN NaN

In [86]:
B.pow(A , fill_value = fill_)

              A             B             C             D
0  5.259913e+16  5.010960e+35  9.313226e+20  5.250470e+40
1  1.448963e+32  9.065738e+18  4.019989e+27  1.350479e+24
2  2.361687e+44  7.610438e+42  9.078464e+29  3.887858e+16
3  1.455827e+30  1.511544e+33  5.056933e+37  5.056933e+37

##### Operations Between DataFrame

In [118]:
a = pd.DataFrame(np.random.randint(10,30 , size= (3,4)) , columns = list("ABCD"))
print(a)

    A   B   C   D
0  25  16  13  21
1  12  29  21  25
2  10  29  17  13

In [119]:
a - a.iloc[0]  ##subtract a row Series from a DataFrame, Pandas broadcasts it row-wise

    A   B  C  D
0   0   0  0  0
1 -13  13  8  4
2 -15  13  4 -8

In [120]:
a - a.iloc[1]

    A   B  C   D
0  13 -13 -8  -4
1   0   0  0   0
2  -2   0 -4 -12

In [110]:
## operate column-wise
A.subtract(A["A"], axis=0)

   A  B  C   D
0  0 -9  0 -10
1  0 -3 -9  -1
2  0  6  6  -3

In [121]:
sub = a.iloc[0:3,:1]
a - sub

## sub has only column A, so only column A in 'a' will be subtracted.
## Columns B and C in 'a' don’t exist in the sub - result will be NaN there.

   A   B   C   D
0  0 NaN NaN NaN
1  0 NaN NaN NaN
2  0 NaN NaN NaN

In [141]:
print(a * a.iloc[2]) 
print(a.multiply(a.iloc[2], axis=1))
print(a.multiply(a["B"], axis=0))

     A    B    C    D
0  250  464  221  273
1  120  841  357  325
2  100  841  289  169
     A    B    C    D
0  250  464  221  273
1  120  841  357  325
2  100  841  289  169
     A    B    C    D
0  400  256  208  336
1  348  841  609  725
2  290  841  493  377

#### Handling Missing Data

In [3]:
import numpy as np
import pandas as pd

In [7]:
## None: Pythonic missing data
data = np.array([[5.23,4.65,7.88 ,None],
                 [6.77,3.22,4.55,6.43],
                 [None,7.88,None,8.33]])
data

array([[5.23, 4.65, 7.88, None],
       [6.77, 3.22, 4.55, 6.43],
       [None, 7.88, None, 8.33]], dtype=object)

In [8]:
## if you perform aggregations like sum() or min() across an array with a None value, you will generally get an error:
data.sum()

TypeError: unsupported operand type(s) for +: 'float' and 'NoneType'

In [21]:
##NaN: Missing numerical data
data = np.array([1, np.nan, 3, 4])
data.dtype

dtype('float64')

In [16]:
a = 1 + np.nan
print(a) 

b = 0 * np.nan
b

##  Regardless of the operation, the result of arithmetic with NaN will be another NaN

nan

nan

In [25]:
data.max() , data.min , data.sum

(np.float64(nan), <function ndarray.min>, <function ndarray.sum>)

In [27]:
## some special aggregations that will ignore these missing values:
a = np.nansum(data) 
b = np.nanmin(data)
print(a)
print(b)

8.0
1.0

#### NaN and None in Pandas

In [29]:
pd.Series([1, np.nan, 3, 4])

0    1.0
1    NaN
2    3.0
3    4.0
dtype: float64

In [32]:
a = pd.Series(range(2) , dtype = int)
a

0    0
1    1
dtype: int64

In [34]:
a[0] = None
a              ## Pandas automatically converts the None to a NaN value

0    NaN
1    1.0
dtype: float64

#### Operating on Null Values

##### Detecting null values

In [36]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

## return the boolean value  -  indicating the missing values(note - numbers) as True

0    False
1     True
2    False
3     True
dtype: bool

In [41]:
print(data.notnull())   ##  Opposite of isnull()
data[data.notnull()]    ## returns the non missing values

0     True
1    False
2     True
3    False
dtype: bool

0        1
2    hello
dtype: object

In [43]:
data.dropna()    ## drops the missing values

0        1
2    hello
dtype: object

In [44]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [45]:
print(df.isnull())
print(df.notnull())
print(df.dropna())
print(df.fillna(0))

       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False
       0      1     2
0   True  False  True
1   True   True  True
2  False   True  True
     0    1  2
1  2.0  3.0  5
     0    1  2
0  1.0  0.0  2
1  2.0  3.0  5
2  0.0  4.0  6

In [47]:
## Alternatively, you can drop NA values along a different axis
df.dropna(axis = 1)   ## drops all the columns which as null values

   2
0  2
1  5
2  6

In [48]:
df.dropna(axis = 0)

     0    1  2
1  2.0  3.0  5

In [58]:
## specify which will only drop rows/columns that are all null values
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6],
                  [np.nan,np.nan,np.nan]])
print(df)

df.dropna(axis= 0, how='all')

     0    1    2
0  1.0  NaN  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0
3  NaN  NaN  NaN

     0    1    2
0  1.0  NaN  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0

In [62]:
## specify a minimum number of non-null values for the row/column to be kept
df.dropna(axis= 1, thresh=3)

     2
0  2.0
1  5.0
2  6.0
3  NaN

In [70]:
## forward-fill and backward fill

data = pd.Series([1, np.nan, 2, None, 3])
data.fillna(method = "bfill")

C:\Users\vishnu\AppData\Local\Temp\ipykernel_14752\1178501377.py:4: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method = "bfill")

0    1.0
1    2.0
2    2.0
3    3.0
4    3.0
dtype: float64

In [71]:
data = pd.Series([1, np.nan, 2, None, 3])
data.fillna(method = "ffill")

C:\Users\vishnu\AppData\Local\Temp\ipykernel_14752\2484889564.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method = "ffill")

0    1.0
1    1.0
2    2.0
3    2.0
4    3.0
dtype: float64

In [73]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6],
                  [np.nan,np.nan,np.nan]])
print(df)

df.fillna(method = "ffill" , axis = 0)

     0    1    2
0  1.0  NaN  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0
3  NaN  NaN  NaN

C:\Users\vishnu\AppData\Local\Temp\ipykernel_14752\3336224385.py:7: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "ffill" , axis = 0)

     0    1    2
0  1.0  NaN  2.0
1  2.0  3.0  5.0
2  2.0  4.0  6.0
3  2.0  4.0  6.0

In [75]:
df.fillna(method = "ffill" , axis = 1)  ## if a previous value is not available during a forward fill, the NA value remains.

C:\Users\vishnu\AppData\Local\Temp\ipykernel_14752\2166514853.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "ffill" , axis = 1)  ## if a previous value is not available during a forward fill, the NA value remains.

     0    1    2
0  1.0  1.0  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0
3  NaN  NaN  NaN

#### Hierarchical Indexing

##### Pandas MultiIndex

In [78]:
names = [("Padma", 2000), ("Padma", 2010),
         ("Kavin", 2000), ("Kavin", 2010),
         ("David", 2000), ("David", 2010)]
marks = [338, 956,
         764, 102,
         820, 561]
Info = pd.Series(marks , index = names)
Info  ##bad way of presenting

(Padma, 2000)    338
(Padma, 2010)    956
(Kavin, 2000)    764
(Kavin, 2010)    102
(David, 2000)    820
(David, 2010)    561
dtype: int64

In [81]:
names = pd.MultiIndex.from_tuples(names)
names

MultiIndex([('Padma', 2000),
            ('Padma', 2010),
            ('Kavin', 2000),
            ('Kavin', 2010),
            ('David', 2000),
            ('David', 2010)],
           )

In [83]:
Info = Info.reindex(names)
Info                          ##  first two columns of the Series representation show the multiple index values, while the third column shows the data

Padma  2000    338
       2010    956
Kavin  2000    764
       2010    102
David  2000    820
       2010    561
dtype: int64

In [100]:
names = [("Padma", 2000), ("Padma", 2010),
         ("Kavin", 2000), ("Kavin", 2010),
         ("David", 2000), ("David", 2010)]
marks = [338, 956,
         764, 102,
         820, 561]
percentage = [45.67,87.56,
              78.99,46.22,
              88.88,76.88]
Info = pd.DataFrame({
    "names" : names,
    "Marks": marks,
    "Percentage": percentage})
Info

           names  Marks  Percentage
0  (Padma, 2000)    338       45.67
1  (Padma, 2010)    956       87.56
2  (Kavin, 2000)    764       78.99
3  (Kavin, 2010)    102       46.22
4  (David, 2000)    820       88.88
5  (David, 2010)    561       76.88

In [98]:
names = pd.MultiIndex.from_tuples(names , names=["Name", "Year"])
names

MultiIndex([('Padma', 2000),
            ('Padma', 2010),
            ('Kavin', 2000),
            ('Kavin', 2010),
            ('David', 2000),
            ('David', 2010)],
           names=['Name', 'Year'])

In [101]:
Info = pd.DataFrame({
    "Marks": marks,
    "Percentage": percentage} , index = pd.MultiIndex.from_tuples(names , names=["Name", "Year"]))
Info

            Marks  Percentage
Name  Year
Padma 2000    338       45.67
      2010    956       87.56
Kavin 2000    764       78.99
      2010    102       46.22
David 2000    820       88.88
      2010    561       76.88

In [117]:

names = [("Padma", 2000), ("Padma", 2010),
         ("Kavin", 2000), ("Kavin", 2010),
         ("David", 2000), ("David", 2010)]
marks = [338, 956,
         764, 102,
         820, 561]
Info = pd.DataFrame({"Marks" : marks} , index = pd.MultiIndex.from_tuples(names))

In [116]:
## access all data for which the second index is 2010
Info.loc[pd.IndexSlice[:, 2010], :]

            Marks
Padma 2010    956
Kavin 2010    102
David 2010    561

##### MultiIndex as extra dimension

In [124]:
## convert a multiply indexed Series into a conventionally indexed DataFrame
names = [("Padma", 2000), ("Padma", 2010),
         ("Kavin", 2000), ("Kavin", 2010),
         ("David", 2000), ("David", 2010)]
marks = [338, 956,
         764, 102,
         820, 561]
names = pd.MultiIndex.from_tuples(names)

Info_df = pd.Series(marks , names)

print(Info_df.unstack())

       2000  2010
David   820   561
Kavin   764   102
Padma   338   956

In [127]:
names = [("Padma", 2000), ("Padma", 2010),
         ("Kavin", 2000), ("Kavin", 2010),
         ("David", 2000), ("David", 2010)]
marks = [338, 956,
         764, 102,
         820, 561]
Info = pd.DataFrame({"Marks" : marks} , index = pd.MultiIndex.from_tuples(names))

print(Info.unstack())
print(Info.stack())

      Marks
       2000 2010
David   820  561
Kavin   764  102
Padma   338  956
Padma  2000  Marks    338
       2010  Marks    956
Kavin  2000  Marks    764
       2010  Marks    102
David  2000  Marks    820
       2010  Marks    561
dtype: int64

#### Methods of MultiIndex Creation

In [3]:
names = [("Padma", 2000), ("Padma", 2010),
         ("Kavin", 2000), ("Kavin", 2010),
         ("David", 2000), ("David", 2010)]
marks = [338, 956,
         764, 102,
         820, 561]
Info = pd.DataFrame({"names":names , "marks":marks})
Info

           names  marks
0  (Padma, 2000)    338
1  (Padma, 2010)    956
2  (Kavin, 2000)    764
3  (Kavin, 2010)    102
4  (David, 2000)    820
5  (David, 2010)    561

In [17]:
data = {("Padma", 2000):338,
         ("Padma", 2010):956,
         ("Kavin", 2000):764,
         ("Kavin", 2010):102,
         ("David", 2000):820,
         ("David", 2010):561}

Info = pd.Series(data)
print(Info)

Padma  2000    338
       2010    956
Kavin  2000    764
       2010    102
David  2000    820
       2010    561
dtype: int64

In [22]:
data = {("Padma", 2000):338,
         ("Padma", 2010):956,
         ("Kavin", 2000):764,
         ("Kavin", 2010):102,
         ("David", 2000):820,
         ("David", 2010):561}

Info = pd.Series(data)

Info.index.names = ["Name","Year"]
Info

Name   Year
Padma  2000    338
       2010    956
Kavin  2000    764
       2010    102
David  2000    820
       2010    561
dtype: int64

In [3]:
import numpy as np

index = pd.MultiIndex.from_product([[2020, 2024], [1, 2]],
                                   names=['year', 'sl.no'])
columns = pd.MultiIndex.from_product([['Maths', 'Chemistry', 'Physics'], ['Marks', 'Percentage']],
                                     names=['subject', 'Score'])

data = np.random.randint(300,500, size=(4, 6))
marks = data[:, [1, 3, 5]]
percentage = (marks/500)*100

result = np.empty((marks.shape[0], marks.shape[1]*2))
result[:, 0::2] = marks      
result[:, 1::2] = percentage

perf = pd.DataFrame(result,index=index,columns=columns)
perf

subject     Maths            Chemistry            Physics
Score       Marks Percentage     Marks Percentage   Marks Percentage
year sl.no
2020 1      308.0       61.6     395.0       79.0   327.0       65.4
     2      397.0       79.4     335.0       67.0   498.0       99.6
2024 1      444.0       88.8     335.0       67.0   479.0       95.8
     2      444.0       88.8     476.0       95.2   385.0       77.0

In [28]:
perf["Maths"]

Score       Marks  Percentage
year sl.no
2020 1      431.0        89.0
     2      315.0        63.8
2024 1      376.0        76.0
     2      301.0        64.6

##### Indexing and Slicing a MultiIndex

In [9]:
perf.iloc[:3,:3]

subject     Maths            Chemistry
Score       Marks Percentage     Marks
year sl.no
2020 1      470.0       94.0     394.0
     2      389.0       77.8     363.0
2024 1      453.0       90.6     390.0

In [15]:
perf.iloc[0:3,:2]

subject     Maths
Score       Marks Percentage
year sl.no
2020 1      470.0       94.0
     2      389.0       77.8
2024 1      453.0       90.6

In [26]:
perf.loc[:,("Physics","Percentage")]

year  sl.no
2020  1        89.2
      2        67.6
2024  1        60.4
      2        96.8
Name: (Physics, Percentage), dtype: float64

In [25]:
perf.loc[(2020,1),("Physics","Percentage")]

np.float64(89.2)

In [27]:
perf.loc[(2020,2),("Physics","Percentage")]

np.float64(67.60000000000001)

##### Sorting and unsorting

In [47]:
index = pd.MultiIndex.from_product([["a","b","c"],[1,2,3]])
data = pd.Series(np.random.randint(1,9) , index=index)
data  
### the value is repeated , so this can't be used for sorting

a  1    7
   2    7
   3    7
b  1    7
   2    7
   3    7
c  1    7
   2    7
   3    7
dtype: int64

In [54]:
index = pd.MultiIndex.from_product([["a","b","c","d"],[1,2]])
data = pd.Series(np.random.rand(8) , index=index)
data

a  1    0.310316
   2    0.053925
b  1    0.500039
   2    0.206732
c  1    0.676649
   2    0.332522
d  1    0.639966
   2    0.410237
dtype: float64

In [55]:
data.sort_index()

a  1    0.310316
   2    0.053925
b  1    0.500039
   2    0.206732
c  1    0.676649
   2    0.332522
d  1    0.639966
   2    0.410237
dtype: float64

In [64]:
index = pd.MultiIndex.from_product([["a","b","c","d"],[1,2]])
lists = [23,43,84,77,13,23,22,35]
data = pd.Series(lists , index=index)
data

a  1    23
   2    43
b  1    84
   2    77
c  1    13
   2    23
d  1    22
   2    35
dtype: int64

In [65]:
data.sort_index()

a  1    23
   2    43
b  1    84
   2    77
c  1    13
   2    23
d  1    22
   2    35
dtype: int64

In [69]:
index = pd.MultiIndex.from_product([["a","b","c","d"],[1,2]])
lists = [23,43,84,77,13,23,22,35]
data = pd.DataFrame(lists , index=index , columns = ["values"])
data

     values
a 1      23
  2      43
b 1      84
  2      77
c 1      13
  2      23
d 1      22
  2      35

In [71]:
data.sort_index()

     values
a 1      23
  2      43
b 1      84
  2      77
c 1      13
  2      23
d 1      22
  2      35

MultiIndex not being sorted. For various reasons
partial slices and other similar operations require the levels in the MultiIndex to be in sorted (i.e., lexographical) order.

In [72]:
data["a":"c"]

     values
a 1      23
  2      43
b 1      84
  2      77
c 1      13
  2      23

Combining Datasets

In [9]:
### concatenation of arrays
x = pd.Series([2,3,5,3])
y = pd.Series([10,23,34,34])

pd.concat([x,y])

0     2
1     3
2     5
3     3
0    10
1    23
2    34
3    34
dtype: int64

In [10]:
x = pd.Series([2,3,5,3])
y = pd.Series([10,23,34,34])
z = pd.Series([10,23,34,34])
pd.concat([x,y,z])

0     2
1     3
2     5
3     3
0    10
1    23
2    34
3    34
0    10
1    23
2    34
3    34
dtype: int64

In [11]:
x =pd.DataFrame([[23,23,45,23],
     [54,52,75,73]])
pd.concat([x,x], axis =0)

    0   1   2   3
0  23  23  45  23
1  54  52  75  73
0  23  23  45  23
1  54  52  75  73

In [12]:
pd.concat([x,x], axis =1)

    0   1   2   3   0   1   2   3
0  23  23  45  23  23  23  45  23
1  54  52  75  73  54  52  75  73

In [13]:
x =pd.DataFrame([[23,23,45,23],
     [54,52,75,73]])

y = pd.DataFrame([[213,233,445,273],
     [154,552,765,373]])

display(x,y, pd.concat([x,y]))

    0   1   2   3
0  23  23  45  23
1  54  52  75  73

     0    1    2    3
0  213  233  445  273
1  154  552  765  373

     0    1    2    3
0   23   23   45   23
1   54   52   75   73
0  213  233  445  273
1  154  552  765  373

Concatenation with joins

In [38]:
x =pd.DataFrame(np.random.randint(23,79,size=(4,4)), columns = ["A","B","C","D"])
y =pd.DataFrame(np.random.randint(33,99,size=(4,4)), columns = ["B","C","D","E"])

dis = pd.concat([x, y], join="outer")
print(dis)

      A   B   C   D     E
0  70.0  65  24  62   NaN
1  62.0  66  61  70   NaN
2  40.0  66  46  68   NaN
3  62.0  54  66  69   NaN
0   NaN  35  93  54  63.0
1   NaN  56  80  49  36.0
2   NaN  50  97  45  86.0
3   NaN  56  56  46  56.0

In [39]:
display(pd.concat([x,y],join="inner"))

    B   C   D
0  65  24  62
1  66  61  70
2  66  46  68
3  54  66  69
0  35  93  54
1  56  80  49
2  50  97  45
3  56  56  46

Merge and Join

In [47]:
group1 = pd.DataFrame({"names":["Joe","Kavin","Padma","Hema"],
                       "class":[3,2,4,1]})
group2 = pd.DataFrame({"names":["Joe","Sreelakshmi","Padma","Berlin"],
                       "year":[2025,2012,2004,2010]})
display(group1,group2)

   names  class
0    Joe      3
1  Kavin      2
2  Padma      4
3   Hema      1

         names  year
0          Joe  2025
1  Sreelakshmi  2012
2        Padma  2004
3       Berlin  2010

In [49]:
pd.merge(group1,group2)  ## Merging Names That Are Common to Both Lists

   names  class  year
0    Joe      3  2025
1  Padma      4  2004

In [67]:
### Many-to-one joins
group3 = pd.DataFrame({"year":[2025,2004,2012,2010] , 
                    "age" : [00,21,13,15]})
pd.merge(group2,group3)

         names  year  age
0          Joe  2025    0
1  Sreelakshmi  2012   13
2        Padma  2004   21
3       Berlin  2010   15

In [53]:
group4 = pd.DataFrame({"class":[3,3,2,2,4,4],
                       "subject":["Science","Maths","Social", "Science","English","Hindi"]})
pd.merge(group1,group4)

   names  class  subject
0    Joe      3  Science
1    Joe      3    Maths
2  Kavin      2   Social
3  Kavin      2  Science
4  Padma      4  English
5  Padma      4    Hindi

Specification of the Merge Key

In [56]:
pd.merge(group1,group2, on="names")

   names  class  year
0    Joe      3  2025
1  Padma      4  2004

In [57]:
pd.merge(group1,group4, on="class")

   names  class  subject
0    Joe      3  Science
1    Joe      3    Maths
2  Kavin      2   Social
3  Kavin      2  Science
4  Padma      4  English
5  Padma      4    Hindi

In [76]:
group4 = pd.DataFrame({"stu_name":["Joe","Kavin","Padma","Hema"],
                       "subject":["Science","Maths","Social", "Science"]})
display(group1,group4)

pd.merge(group1,group4,left_on="names",right_on="stu_name")

   names  class
0    Joe      3
1  Kavin      2
2  Padma      4
3   Hema      1

  stu_name  subject
0      Joe  Science
1    Kavin    Maths
2    Padma   Social
3     Hema  Science

   names  class stu_name  subject
0    Joe      3      Joe  Science
1  Kavin      2    Kavin    Maths
2  Padma      4    Padma   Social
3   Hema      1     Hema  Science

In [78]:
pd.merge(group1,group4,left_on="names",right_on="stu_name").drop("stu_name",axis=1)

   names  class  subject
0    Joe      3  Science
1  Kavin      2    Maths
2  Padma      4   Social
3   Hema      1  Science

In [80]:
group1 = pd.DataFrame({"names":["Joe","Kavin","Padma","Hema"],
                       "class":[3,2,4,1]})
group2 = pd.DataFrame({"names":["Joe","Sreelakshmi","Padma","Berlin"],
                       "year":[2025,2012,2004,2010]})
pd.merge(group1,group2,how="inner")

   names  class  year
0    Joe      3  2025
1  Padma      4  2004

In [81]:
pd.merge(group1,group2,how="outer")

         names  class    year
0       Berlin    NaN  2010.0
1         Hema    1.0     NaN
2          Joe    3.0  2025.0
3        Kavin    2.0     NaN
4        Padma    4.0  2004.0
5  Sreelakshmi    NaN  2012.0

In [82]:
pd.merge(group1,group2,how="left")

   names  class    year
0    Joe      3  2025.0
1  Kavin      2     NaN
2  Padma      4  2004.0
3   Hema      1     NaN

In [83]:
pd.merge(group1,group2,how="right")

         names  class  year
0          Joe    3.0  2025
1  Sreelakshmi    NaN  2012
2        Padma    4.0  2004
3       Berlin    NaN  2010